Repository: coderhh/fpv_garage
Catalog: FPVGarage/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %lld sec
zh_hans: %lld 秒

source: 20 per aircraft
zh_hans: 每架飞机20个

source: About
zh_hans: 关于

source: Active
zh_hans: 使用中

source: Add Aircraft
zh_hans: 添加飞机

source: Add aircraft setup or add parts manually
zh_hans: 添加飞机配置或手动添加部件

source: Add Battery
zh_hans: 添加电池

source: Add Flight
zh_hans: 添加飞行

source: Add Part
zh_hans: 添加部件

source: Add Photo
zh_hans: 添加照片

source: Address (Optional)
zh_hans: 地址(选填)

source: Adequate
zh_hans: 足够

source: Advanced
zh_hans: 高级

source: Advice Detail
zh_hans: 建议详情

source: Advice History
zh_hans: 建议历史

source: Advice Settings
zh_hans: 建议设置

source: Aging
zh_hans: 老化

source: AI Advice Settings
zh_hans: AI建议设置

source: AI Config Advice
zh_hans: AI配置建议

source: Aircraft
zh_hans: 飞机

source: Aircraft Details
zh_hans: 飞机详情

source: Aircraft name, flight style, pilot skill level, motor specs, TWR ratio, compatibility warnings
zh_hans: 飞机名称、飞行风格、飞手技能等级、电机规格、推重比、兼容性警告

source: All
zh_hans: 全部

source: All-Up Weight (g)
zh_hans: 全机重量(克)

source: API Key
zh_hans: API密钥

source: API Key — %@
zh_hans: API密钥 — %@

source: API Key Saved
zh_hans: API密钥已保存

source: API Key Set
zh_hans: API密钥已设置

source: Audit Trail
zh_hans: 审计追踪

source: Base URL
zh_hans: 基础URL

source: Basic Info
zh_hans: 基本信息

source: Batteries
zh_hans: 电池

source: Batteries Used
zh_hans: 使用电池

source: Battery cell count and capacity (no names or personal data)
zh_hans: 电池芯数和容量(无名称或个人数据)

source: Battery Cells
zh_hans: 电池芯数

source: Beginner
zh_hans: 初学者

source: Build
zh_hans: 构建号

source: Camera
zh_hans: 摄像头 Camera

source: Cancel
zh_hans: 取消

source: Capacity (mAh)
zh_hans: 容量(mAh)

source: Cell Count (S)
zh_hans: 电芯数(S)

source: Choose from Library
zh_hans: 从相册选择

source: Cinematic
zh_hans: 电影飞

source: Clear All
zh_hans: 清除全部

source: Clear All Data
zh_hans: 清除所有数据

source: Clear All History?
zh_hans: 清除全部历史?

source: Clear Location
zh_hans: 清除位置

source: Compat warnings
zh_hans: 兼容性警告

source: Compatibility
zh_hans: 兼容性

source: Compatibility Notes
zh_hans: 兼容性说明

source: Config Advice
zh_hans: 配置建议

source: Config changed — regenerate?
zh_hans: 配置已更改 — 重新生成?

source: Config has changed since this advice was generated.
zh_hans: 自生成此建议以来配置已更改。

source: Config Hash
zh_hans: 配置哈希

source: Connection interrupted. Try again.
zh_hans: 连接中断。请重试。

source: Coordinates
zh_hans: 坐标

source: Could not parse LLM response.
zh_hans: 无法解析LLM响应。

source: Created
zh_hans: 创建时间

source: Cycle Count
zh_hans: 循环次数

source: Cycles %lld
zh_hans: 循环 %lld

source: Damaged
zh_hans: 损坏

source: Data
zh_hans: 数据

source: Debug
zh_hans: 调试

source: Delete
zh_hans: 删除

source: Delete Aircraft
zh_hans: 删除飞机

source: Delete All
zh_hans: 全部删除

source: Delete All Advice Sessions
zh_hans: 删除所有建议会话

source: Delete All Sessions?
zh_hans: 删除所有会话?

source: Detailed Setup
zh_hans: 详细配置

source: Development & Testing
zh_hans: 开发与测试

source: Duration (sec)
zh_hans: 飞行时长(秒)

source: Edit
zh_hans: 编辑

source: Edit Aircraft
zh_hans: 编辑飞机

source: Edit Battery
zh_hans: 编辑电池

source: Edit Flight
zh_hans: 编辑飞行

source: Edit Part
zh_hans: 编辑部件

source: Empty response from LLM.
zh_hans: 来自LLM的空响应。

source: Enable
zh_hans: 启用

source: ESC
zh_hans: 电调 ESC

source: Estimated
zh_hans: 估算

source: Export All Data (JSON)
zh_hans: 导出所有数据 (JSON)

source: Filter
zh_hans: 筛选

source: Flight Controller
zh_hans: 飞控 FC

source: Flight Count
zh_hans: 飞行次数

source: Flight Details
zh_hans: 飞行详情

source: Flight Duration
zh_hans: 飞行时长

source: Flight Location
zh_hans: 飞行地点

source: Flight Records
zh_hans: 飞行记录

source: Flight Style
zh_hans: 飞行风格

source: Flights
zh_hans: 飞行

source: Frame
zh_hans: 机架 Frame

source: Frame Size (inches)
zh_hans: 机架大小(英寸)

source: Freestyle
zh_hans: 自由飞

source: Generate Test Data
zh_hans: 生成测试数据

source: Generated
zh_hans: 生成时间

source: Generating advice...
zh_hans: 正在生成建议...

source: Get AI Advice
zh_hans: 获取AI建议

source: Good
zh_hans: 很好

source: High
zh_hans: 高

source: History
zh_hans: 历史

source: Home
zh_hans: 首页

source: Ideal
zh_hans: 理想

source: Improvements
zh_hans: 改进

source: Intermediate
zh_hans: 中级

source: Invalid API key. Check Settings.
zh_hans: 无效的API密钥。请检查设置。

source: Language
zh_hans: 语言

source: Last Updated
zh_hans: 最后更新

source: Latitude
zh_hans: 纬度

source: LLM Configuration Advice
zh_hans: LLM配置建议

source: Location
zh_hans: 地点

source: Long Range
zh_hans: 远程

source: Longitude
zh_hans: 经度

source: Low
zh_hans: 低

source: Map Selection
zh_hans: 地图选点

source: Measured
zh_hans: 实测

source: Medium
zh_hans: 中

source: Metadata
zh_hans: 元数据

source: Model
zh_hans: 模型

source: Model (Optional)
zh_hans: 机型(选填)

source: Motor
zh_hans: 电机 Motor

source: Motor KV
zh_hans: 电机KV

source: Motor Model
zh_hans: 电机型号

source: Motor Thrust (g/motor)
zh_hans: 电机推力(克/电机)

source: My Aircraft
zh_hans: 我的飞机

source: My Batteries
zh_hans: 我的电池

source: My Parts
zh_hans: 我的部件

source: Name
zh_hans: 名称

source: No advice history yet.
zh_hans: 暂无建议历史。

source: No Aircraft
zh_hans: 暂无飞机

source: No API key configured.
zh_hans: 未配置API密钥。

source: No Batteries
zh_hans: 暂无电池

source: No Flight Records
zh_hans: 暂无飞行记录

source: No network connection.
zh_hans: 没有网络连接。

source: No Parts
zh_hans: 暂无部件

source: Not Set
zh_hans: 未设置

source: OK
zh_hans: 好

source: Optional
zh_hans: 选填

source: Other
zh_hans: 其他

source: Overview
zh_hans: 概览

source: Part counts by category
zh_hans: 按类别分类的部件数量

source: Part Details
zh_hans: 部件详情

source: Part Suggestions
zh_hans: 部件建议

source: Part suggestions are AI-generated and may be inaccurate. Always verify before purchasing.
zh_hans: 部件建议由AI生成，可能不准确。购买前请务必验证。

source: Parts
zh_hans: 部件

source: Performance Data
zh_hans: 性能数据

source: Photo
zh_hans: 照片

source: Pilot Skill
zh_hans: 飞手技能

source: Please restart the app for the language change to take effect.
zh_hans: 请重启应用以使语言更改生效。

source: Please Select
zh_hans: 请选择

source: Prop Size
zh_hans: 桨叶大小

source: Propeller
zh_hans: 桨叶 Propeller

source: Provider
zh_hans: 提供商

source: Provider Key
zh_hans: 提供商密钥

source: Quantity
zh_hans: 数量

source: Racing
zh_hans: 竞速

source: Rate limited. Please try again later.
zh_hans: 速率限制。请稍后重试。

source: Receiver
zh_hans: 接收机 Receiver

source: Regenerate
zh_hans: 重新生成

source: Remark
zh_hans: 备注

source: Remove Key
zh_hans: 删除密钥

source: Restart Required
zh_hans: 需要重启

source: Retired
zh_hans: 已退役

source: Save
zh_hans: 保存

source: Save Key
zh_hans: 保存密钥

source: Select Aircraft
zh_hans: 选择飞机

source: Select Photo Source
zh_hans: 选择照片来源

source: Sell with Parts (Delete Parts)
zh_hans: 卖掉整机（删除对应部件）

source: Serial (Optional)
zh_hans: 编号(选填)

source: Server error (%lld).
zh_hans: 服务器错误(%lld)。

source: Session Cap
zh_hans: 会话上限

source: Set Up API Key
zh_hans: 设置API密钥

source: Settings
zh_hans: 设置

source: Source Aircraft
zh_hans: 来源飞机

source: Spec Sheet
zh_hans: 规格表

source: Specifications
zh_hans: 规格

source: Stale
zh_hans: 已过期

source: Status
zh_hans: 状态

source: Strengths
zh_hans: 优势

source: Summary
zh_hans: 总结

source: Take Photo
zh_hans: 拍照

source: Takeoff Time
zh_hans: 起飞时间

source: Tap + to add
zh_hans: 点击 + 添加

source: Tap map to set flight location
zh_hans: 点击地图设置飞行位置

source: Tear Apart (Keep Parts)
zh_hans: 拆机保留部件

source: This feature uses an LLM to analyze your aircraft configuration and provide advice.
zh_hans: 此功能使用LLM分析您的飞机配置并提供建议。

source: This will delete all advice history for all aircraft.
zh_hans: 这将删除所有飞机的所有建议历史。

source: This will delete all advice history for this aircraft.
zh_hans: 这将删除此飞机的所有建议历史。

source: This will permanently delete all aircraft, batteries, flights, and parts. This action cannot be undone.
zh_hans: 这将永久删除所有飞机、电池、飞行记录和部件，此操作不可撤销。

source: Thrust Data Source
zh_hans: 推力数据源

source: Thrust-to-Weight Ratio
zh_hans: 推重比

source: Time & Duration
zh_hans: 时间与时长

source: Total Duration (sec)
zh_hans: 总时长(秒)

source: TWR at generation
zh_hans: 生成时推重比

source: TWR Comment
zh_hans: 推重比评论

source: Type
zh_hans: 类型

source: Underpowered
zh_hans: 动力不足

source: Use Current Location
zh_hans: 使用当前定位

source: Version
zh_hans: 版本

source: VTX
zh_hans: 图传 VTX

source: We will send to the LLM provider:
zh_hans: 我们将向LLM提供商发送:

source: Whoop
zh_hans: 涵道

source: You can disable this feature at any time in Settings.
zh_hans: 您可以随时在设置中禁用此功能。

source: Your API key is stored securely in Keychain. We do not proxy or meter your usage.
zh_hans: 您的API密钥安全存储在Keychain中。我们不代理或计费您的使用情况。

source: Your API key is stored securely in the iOS Keychain. It is never included in data exports or sent to anyone other than the selected LLM provider.
zh_hans: 您的API密钥安全存储在iOS钥匙串中。它永远不会包含在数据导出中，也不会发送给除所选LLM提供商外的任何人。

source: Your device locale
zh_hans: 您的设备语言
